doc/cap-post.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>cap-post</code></title>
<!-- 2013-09-16 Mon 18:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="William Henney" />
</head>
<body>
<div id="content">
<h1 class="title"><code>cap-post</code></h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Postprocess Capreole datasets</h2>
<div class="outline-text-2" id="text-1">
<p>
All these programs work with datacubes in FITS format. See <code>[[http://github.com/deprecated/ah3-utils][ah3-utils]]</code> for how to convert Capreole's native AH3 format to FITS. 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Package layout</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt> <code>doc/cap-post.org</code> </dt><dd>Source for documentation in Org-mode format  
</dd>
<dt> <code>doc/cap-post.html</code> </dt><dd>Compiled HTML file of documentation
</dd>
<dt> <code>src/*.{f90,sh}</code> </dt><dd>Programs and convenience scripts
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Compilation</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>First install the <i>dependencies</i>
</li>
<li>Enter the <code>src/</code> directory
</li>
<li>[OPTIONAL] Copy <code>local.mk.sample</code> to <code>local.mk</code> and edit it to specify the desired compiler command (<code>F90C</code>), compiler options (<code>F90LAGS</code>), and libraries to link (<code>LFITS</code>). 
<ul class="org-ul">
<li>The default values are 
<pre class="example">
F90C=gfortran
F90FLAGS=-O3
LFITS=/usr/local/lib/libcfitsio.a
</pre>
</li>
</ul>
</li>
<li>Compile everything with 
<div class="org-src-container">

<pre class="src src-bash">make all
</pre>
</div>
</li>
<li>Most programs are designed to be run in the directory where the data is.  For convenience, you may want to set a shell variable to the directory where the programs are, e.g.: <code>psrc=/path/to/cap-post/src</code>.  So you can then type <code>sh $psrc/fitsemiss.sh ...</code> 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Convenience scripts</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The general default behavior of these scripts is to process all the save times of a given model in the current directory.  Usage is as follows:
</p>

<div class="org-src-container">

<pre class="src src-bash">sh SCRIPT.sh DATEID RUNID EMTYPE [I1] [I2] [ISTEP]
</pre>
</div>

<dl class="org-dl">
<dt> DATEID </dt><dd>something like <code>30112005</code>
</dd>
<dt> RUNID </dt><dd>the one-letter id code, such as <code>x</code>
</dd>
<dt> EMTYPE </dt><dd>the code for the emission mechanism, such as <code>Halpha</code>
</dd>
<dt> I1 </dt><dd>(optional) the first savetime to process
</dd>
<dt> I2 </dt><dd>(optional) the last savetime to process
</dd>
<dt> ISTEP </dt><dd>(optional) the step in savetimes, such as <code>100</code> to process every 100th time
</dd>
</dl>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">fitsemiss.sh</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Runs <code>cubet</code>, <code>cubeemiss</code>, and <code>makemap</code> as necessary to generate the emission maps.  
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Fortran programs</h3>
<div class="outline-text-3" id="text-1-4">
<p>
These programs can be run individually if necessary, although it is generally easier to use the convenience scripts described above. 
</p>
</div>


<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">cubestats</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Calculate various statistics from the data cubes: 
</p>
<ul class="org-ul">
<li>Average radius of ionization front, calculated as cube root of volume / (4 pi/3):
<ul class="org-ul">
<li>Volume calculated from mask <code>x &gt; 0.9</code>
</li>
<li>Volume calculated by summing <code>x</code> over cells
</li>
</ul>
</li>
<li>Maximum and minimum i-front radii
</li>
<li>Mean radius of ionized gas
</li>
<li>RMS gas velocity dispersion (1D)
<ul class="org-ul">
<li>Mass weighted and volume weighted
</li>
<li>For ionized and neutral gas
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">cubet</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Calculate temperature cube
</p>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">cubevr</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Calculate radial velocity cube (from star, assumed at center of grid). 
</p>
</div>
</div>
<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">cubeemiss</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Calculate emissivity cube for a particular emission process (e.g., <code>Halpha</code>, <code>FF06cm</code>, <code>N26584</code>, <code>neut00</code>, etc). 
</p>
</div>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5">makemap</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Calculate surface brightness maps, for views along the 6 principal axes of the cube: \(\pm x\), \(\pm y\), \(\pm z\). 
</p>
</div>
</div>
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6">makerotmap</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
Calculate surface brightness map for view from an arbitrary direction. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Python programs</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Note that these programs work best with python version &gt; 2.7 and require various python packages to be installed (<code>numpy</code>, <code>pyfits</code>, etc).  
</p>

<p>
On our linux servers (as of 2012) it is necessary to use the EPD version of python instead of the system version.  For instance, by modifying your path:
</p>
<pre class="example">
export PATH=/opt/epd/latest/bin:$PATH
</pre>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">plotvcube.py</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Produces PDF figures of isovelocity or position-velocity cuts through a PPV emission cube. 
</p>
</div>



<div id="outline-container-sec-1-5-1-1" class="outline-5">
<h5 id="sec-1-5-1-1">Command line options for plotvcube.py</h5>
<div class="outline-text-5" id="text-1-5-1-1">
<pre class="example">
$ python ../cap-post/src/plotvcube.py -h
usage: plotvcube.py [-h] [--slice-mode {x-slit,y-slit,isovel}]
                    [--display {contour,grayscale,both}]
                    [--iwindow IWINDOW IWINDOW] [--vlimits VLIMITS VLIMITS]
                    cubename

Plot isovel and PV images from PPV emission cubes

positional arguments:
  cubename              Name of FITS file containing PPV emission cube

optional arguments:
  -h, --help            show this help message and exit
  --slice-mode {x-slit,y-slit,isovel}
                        Mode of operation - which way to slice (default:
                        isovel)
  --display {contour,grayscale,both}
                        How to display the image (default: both)
  --iwindow IWINDOW IWINDOW
                        Range of positions or velocities to sum over (in pixel
                        units) (default: None)
  --vlimits VLIMITS VLIMITS
                        Minimum and maximum velocities in cube (default:
                        [-78.107, 73.896])
</pre>
</div>
</div>
<div id="outline-container-sec-1-5-1-2" class="outline-5">
<h5 id="sec-1-5-1-2">Examples of using plotvcube.py</h5>
<div class="outline-text-5" id="text-1-5-1-2">
<p>
Show PV image of narrow y-slit, summing from x=30 to x=35.  
</p>
<div class="org-src-container">

<pre class="src src-sh">python ../cap-post/src/plotvcube.py 10042012_y_0030vc-Halpha --slice-mode y-slit --iwindow 30 35
</pre>
</div>

<p>
Show isovelocity image of broad velocity channel summing from v=1 to v=50.  
</p>
<div class="org-src-container">

<pre class="src src-sh">python ../cap-post/src/plotvcube.py 10042012_y_0030vc-Halpha --slice-mode isovel --iwindow 1 50
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">makemovie.py</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Make movies of evolution at a fixed viewing angle or rotation at a fixed evolutionary time. 
</p>
</div>

<div id="outline-container-sec-1-5-2-1" class="outline-5">
<h5 id="sec-1-5-2-1">Examples of using makemovie.py</h5>
<div class="outline-text-5" id="text-1-5-2-1">
<p>
These are the command that were used to generate the movies included in Will's talk at the Warsaw conference, July 2012.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5F7F5F; font-style: italic;"># </span><span style="color: #8b8b83; font-style: italic;">Evolution movies</span>
<span style="color: #b9d3ee; font-weight: bold;">for</span> ANGLE<span style="color: #b9d3ee; font-weight: bold;"> in</span> 0 215 135; <span style="color: #b9d3ee; font-weight: bold;">do</span>
    python ../cap-post/src/makemovie.py 04052012_4 <span style="color: #eee8aa; font-style: italic;">\</span>
        --time 3 --mode evo --frames 28 --brightscale 1e8 --orient $<span style="color: #dfaf8f;">ANGLE</span> $<span style="color: #dfaf8f;">ANGLE</span> 
    python ../cap-post/src/makemovie.py 04052012_4 <span style="color: #eee8aa; font-style: italic;">\</span>
        --time 3 --mode evo --emtypes neut00 PAH000 FF06cm <span style="color: #eee8aa; font-style: italic;">\</span>
        --emshort CPF --brightscale 1.0 --bandscales 3e6 0.15 0.25 <span style="color: #eee8aa; font-style: italic;">\</span>
        --orient $<span style="color: #dfaf8f;">ANGLE</span> $<span style="color: #dfaf8f;">ANGLE</span> --frames 28 
<span style="color: #b9d3ee; font-weight: bold;">done</span>
<span style="color: #5F7F5F; font-style: italic;"># </span><span style="color: #8b8b83; font-style: italic;">Tumble movies</span>
python ../cap-post/src/makemovie.py 04052012_4 --time 30
python ../cap-post/src/makemovie.py 04052012_4 --time 20 --brightscale 2e7
python ../cap-post/src/makemovie.py 04052012_4 --time 10
<span style="color: #b9d3ee; font-weight: bold;">for</span> TIME<span style="color: #b9d3ee; font-weight: bold;"> in</span> 10 20 30; <span style="color: #b9d3ee; font-weight: bold;">do</span>
    python ../cap-post/src/makemovie.py 04052012_4 <span style="color: #eee8aa; font-style: italic;">\</span>
        --time $<span style="color: #dfaf8f;">TIME</span> --emtypes neut00 PAH000 FF06cm --emshort CPF --brightscale 1.0 <span style="color: #eee8aa; font-style: italic;">\</span>
        --bandscales 3e6 0.15 0.25
<span style="color: #b9d3ee; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Library modules</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">wfitsutils</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Read and write FITS files.
</p>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">emissmod</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
General mechanism for emissivity calculations.
</p>
</div>
</div>

<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3">em2levmod</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Specific functions for particular types of emission line.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">External dependencies</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Many of the Fortran progams use my <code>wfitsutils</code> module, which depends on the CFITSIO library.  This may be installed as follows:
</p>
</div>

<div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1">Fedora</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">

<pre class="src src-bash">sudo yum install cfitsio
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2">Mac OS X via Homebrew</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">

<pre class="src src-bash">brew install cfitsio
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-3" class="outline-4">
<h4 id="sec-1-7-3">Other</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
Install from <a href="http://freshmeat.net/projects/cfitsio">source</a>, e.g., like this:
</p>
<pre class="example">
wget ftp://heasarc.gsfc.nasa.gov/software/fitsio/c/cfitsio3250.tar.gz
tar xzf cfitsio3250.tar.gz
cd cfitsio
./configure --prefix=/usr/local
make
sudo make install
</pre>
<p>
Of course, you will want to change <code>3250</code> to te latest version. If you don't have <code>wget</code> you can use <code>curl</code> instead (<code>curl URL -o FILENAME</code>). 
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: William Henney</p>
<p class="date">Created: 2013-09-16 Mon 18:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
